In [1]:
#Import libraries
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sb
import numpy as np

## Problem Statement

## Read The Dataset

In [5]:
#Read the CSV File
data_frame=pd.read_csv('..\Data\\potential-talents - Aspiring human resources - seeking human resources.csv', encoding = 'unicode_escape', sep=',', header=0)
data_frame.head()

,id,job_title,location,connection,fit
0,1,2019 C.T. Bauer College of Business Graduate (...,"Houston, Texas",85,NaN
1,2,Native English Teacher at EPIK (English Progra...,Kanada,500+,NaN
2,3,Aspiring Human Resources Professional,"Raleigh-Durham, North Carolina Area",44,NaN
3,4,People Development Coordinator at Ryan,"Denton, Texas",500+,NaN
4,5,Advisory Board Member at Celal Bayar University,"Ä°zmir, TÃ¼rkiye",500+,NaN

## Exploratory Data Analysis

In [6]:
# This operation informs the number of rows and columns
data_frame.shape

(104, 5)

In [7]:
# Look for null data
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104 entries, 0 to 103
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          104 non-null    int64
 1   job_title   104 non-null    object
 2   location    104 non-null    object
 3   connection  104 non-null    object
 4   fit         0 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 4.2+ KB

In [8]:
# This operation summerize each column 
data_frame.describe(include='all')

,id,job_title,location,connection,fit
count,104.000000,104,104,104,0.0
unique,NaN,52,41,33,NaN
top,NaN,2019 C.T. Bauer College of Business Graduate (...,Kanada,500+,NaN
freq,NaN,7,12,44,NaN
mean,52.500000,NaN,NaN,NaN,NaN
std,30.166206,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN
25%,26.750000,NaN,NaN,NaN,NaN
50%,52.500000,NaN,NaN,NaN,NaN
75%,78.250000,NaN,NaN,NaN,NaN
max,104.000000,NaN,NaN,NaN,NaN